embedlinux/Code_learning/SDK_2.5.0_MIMXRT685S/components/pca9420/fsl_pca9420.h
/*
 * Copyright 2018 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

#ifndef _FSL_PCA9420_H_
#define _FSL_PCA9420_H_

/*******************************************************************************
 * Includes
 ******************************************************************************/
#include <stdint.h>
#include <stdbool.h>
#include "fsl_common.h"
#include "fsl_power.h"

/*******************************************************************************
 * Definitions
 ******************************************************************************/

/*! @brief PCA9420 Default I2C address. */
#define PCA9420_DEFAULT_I2C_ADDR 0x61U

/*! @brief Define the Register Memory Map of PCA9420. */
#define PCA9420_DEV_INFO (0x00U)
#define PCA9420_TOP_INT (0x01U)
#define PCA9420_SUB_INT0 (0x02U)
#define PCA9420_SUB_INT0_MASK (0x03U)
#define PCA9420_SUB_INT1 (0x04U)
#define PCA9420_SUB_INT1_MASK (0x05U)
#define PCA9420_SUB_INT2 (0x06U)
#define PCA9420_SUB_INT2_MASK (0x07U)
#define PCA9420_TOP_CNTL0 (0x09U)
#define PCA9420_TOP_CNTL1 (0x0AU)
#define PCA9420_TOP_CNTL2 (0x0BU)
#define PCA9420_TOP_CNTL3 (0x0CU)
#define PCA9420_TOP_CNTL4 (0x0DU)

#define PCA9420_CHG_CNTL0 (0x10U)
#define PCA9420_CHG_CNTL1 (0x11U)
#define PCA9420_CHG_CNTL2 (0x12U)
#define PCA9420_CHG_CNTL3 (0x13U)
#define PCA9420_CHG_CNTL4 (0x14U)
#define PCA9420_CHG_CNTL5 (0x15U)
#define PCA9420_CHG_CNTL6 (0x16U)
#define PCA9420_CHG_CNTL7 (0x17U)
#define PCA9420_CHG_STATUS_0 (0x18U)
#define PCA9420_CHG_STATUS_1 (0x19U)
#define PCA9420_CHG_STATUS_2 (0x1AU)
#define PCA9420_CHG_STATUS_3 (0x1BU)

#define PCA9420_REG_STATUS (0x20U)
#define PCA9420_ACT_DISCHARGE_CNTL_1 (0x21U)
#define PCA9420_MODECFG_0_0 (0x22U)
#define PCA9420_MODECFG_0_1 (0x23U)
#define PCA9420_MODECFG_0_2 (0x24U)
#define PCA9420_MODECFG_0_3 (0x25U)
#define PCA9420_MODECFG_1_0 (0x26U)
#define PCA9420_MODECFG_1_1 (0x27U)
#define PCA9420_MODECFG_1_2 (0x28U)
#define PCA9420_MODECFG_1_3 (0x29U)
#define PCA9420_MODECFG_2_0 (0x2AU)
#define PCA9420_MODECFG_2_1 (0x2BU)
#define PCA9420_MODECFG_2_2 (0x2CU)
#define PCA9420_MODECFG_2_3 (0x2DU)
#define PCA9420_MODECFG_3_0 (0x2EU)
#define PCA9420_MODECFG_3_1 (0x2FU)
#define PCA9420_MODECFG_3_2 (0x30U)
#define PCA9420_MODECFG_3_3 (0x31U)

/*! @brief Define the Register Masks of PCA9420. */
#define PCA9420_TOP_CNTL3_MODE_I2C_MASK (0x18U)
#define PCA9420_TOP_CNTL3_MODE_I2C_SHIFT (0x03U)

#define PCA9420_MODECFG_0_SHIP_EN_MASK (0x80U)
#define PCA9420_MODECFG_0_MODE_CTRL_SEL_MASK (0x40U)
#define PCA9420_MODECFG_0_SW1_OUT_MASK (0x3FU)
#define PCA9420_MODECFG_1_ON_CFG_MASK (0x40U)
#define PCA9420_MODECFG_1_SW2_OUT_MASK (0x3FU)
#define PCA9420_MODECFG_2_LDO1_OUT_MASK (0xF0U)
#define PCA9420_MODECFG_2_LDO1_OUT_SHIFT (0x04U)
#define PCA9420_MODECFG_3_WD_TIMER_MASK (0xC0U)
#define PCA9420_MODECFG_3_LDO2_OUT_MASK (0x3FU)

/*! @brief PCA9420 mode definition. */
typedef enum _pca9420_mode
{
    kPCA9420_Mode0 = 0x00U, /* Mode 0. */
    kPCA9420_Mode1 = 0x01U, /* Mode 1. */
    kPCA9420_Mode2 = 0x02U, /* Mode 2. */
    kPCA9420_Mode3 = 0x03U, /* Mode 3. */
} pca9420_mode_t;

/*! @brief PCA9420 Regulator definition. */
typedef enum _pca9420_regulator
{
    kPCA9420_RegulatorSwitch1 = 0x08U, /* Switch1 regulator. */
    kPCA9420_RegulatorSwitch2 = 0x04U, /* Switch2 regulator. */
    kPCA9420_RegulatorLdo1 = 0x02U,    /* LDO1 regulator. */
    kPCA9420_RegulatorLdo2 = 0x01U,    /* LDO2 regulator. */
} pca9420_regulator_t;

/*! @brief PCA9420 Interrupt Source definition. */
enum _pca9420_interrupt_source
{
    /* Sub_INT0 */
    kPCA9420_IntSrcSysVinOKChanged = 0x1U,    /* VIN_OK changed interrupt source. */
    kPCA9420_IntSrcSysWdogTimeout = 0x2U,     /* Watchdog timeout interrupt source. */
    kPCA9420_IntSrcSysAsysPreWarn = 0x4U,     /* VSYS voltage falls below the VSYS_PRE_WRN interrupt source. */
    kPCA9420_IntSrcSysThermalShutdown = 0x8U, /* Thermal shutdown (Die temp >= THM_STDN) interrupt source. */
    kPCA9420_IntSrcSysTempWarn = 0x10U,       /* Die temp pre-warning (Die temp >= T_WRN) interrupt source. */
    kPCA9420_IntSrcSysAll = 0x1FU,            /* All system interrupt sources. */

    /* Sub_INT1 */
    kPCA9420_IntSrcChgChgOk = 0x100U,            /* CHG_OK changed interrupt source. */
    kPCA9420_IntSrcChgVbatOk = 0x200U,           /* VBAT_OK changed interrupt source. */
    kPCA9420_IntSrcChgVbatDetOk = 0x400U,        /* VBAT_DET_OK changed interrupt source. */
    kPCA9420_IntSrcChgPreChgTimeout = 0x800U,    /* Pre-qualification charge timeout interrupt source. */
    kPCA9420_IntSrcChgFastChgTimeout = 0x1000U,  /* Fast charge timeout interrupt source. */
    kPCA9420_IntSrcChgInputCurrentLmt = 0x2000U, /* Input current limit interrupt source. */
    kPCA9420_IntSrcChgAll = 0x3F00U,             /* All charger interrupt sources. */

    /* Sub_INT2 */
    kPCA9420_IntSrcLdo2VoutOk = 0x10000U,   /* VOUTLDO2_OK changed interrupt source. */
    kPCA9420_IntSrcLdo1VoutOk = 0x20000U,   /* VOUTLDO1_OK changed interrupt source. */
    kPCA9420_IntSrcSw2VoutOk = 0x40000U,    /* VOUTSW2_OK changed interrupt source. */
    kPCA9420_IntSrcSw1VoutOk = 0x80000U,    /* VOUTSW1_OK changed interrupt source. */
    kPCA9420_IntSrcRegulatorAll = 0xF0000U, /* All regulator interrupt sources. */
};

/*! @brief PCA9420 VIN Current Limit Selection definition. */
typedef enum _pca9420_vin_ilim
{
    kPCA9420_VinIlim_74_85_98 = 0x00U,      /* min: 74mA, typ: 85mA, max: 98mA */
    kPCA9420_VinIlim_222_225_293 = 0x20U,   /* min: 222mA, typ: 225mA, max: 293mA */
    kPCA9420_VinIlim_370_425_489 = 0x40U,   /* min: 370mA, typ: 425mA, max: 489mA */
    kPCA9420_VinIlim_517_595_684 = 0x60U,   /* min: 517mA, typ: 595mA, max: 684mA */
    kPCA9420_VinIlim_665_765_880 = 0x80U,   /* min: 665mA, typ: 765mA, max: 880mA */
    kPCA9420_VinIlim_813_935_1075 = 0xA0U,  /* min: 813mA, typ: 935mA, max: 1075mA */
    kPCA9420_VinIlim_961_1105_1271 = 0xC0U, /* min: 961mA, typ: 1105mA, max: 1271mA */
    kPCA9420_VinIlim_Disabled = 0xE0U,      /* Input current limit disabled */
} pca9420_vin_ilim_t;

/*! @brief PCA9420 Ship Wakeup config definition. */
typedef enum _pca9420_ship_wkup_cfg
{
    kPCA9420_ShipWkup_PowerUp = 0x00U,   /* Upon VIN plug in, the chip will enable the battery charging process, and
                                              start the power-up sequence for LDO1/LDO2/SW1/SW2 per the setting */
    kPCA9420_ShipWkup_NoPowerUp = 0x10U, /* Upon VIN plug in, the chip will enable the charging process,
                                              LDO1/LDO2/SW1/SW2 remain in shutdown mode and the chip will only enable
                                              the power-up sequence upon ON pin falling edge */
} pca9420_ship_wkup_cfg_t;

/*! @brief PCA9420 Power Down Sequence Enable definition. */
typedef enum _pca9420_pwr_dn_en
{
    kPCA9420_PwrDnDisabled = 0x00U, /* Do not start power-down sequence */
    kPCA9420_PwrDnEnabled = 0x08U,  /* Start power-down sequence */
} pca9420_pwr_dn_en_t;

/*! @brief PCA9420 Ship Wakeup config definition. */
typedef enum _pca9420_chg_in_watchdog
{
    kPCA9420_ChgInWatchdogChargerContinue = 0x00U, /* When the watchdog timer expires, charger continue its operation */
    kPCA9420_ChgInWatchdogChargerDisabled = 0x04U, /* When the watchdog timer expires, charger is disabled */
} pca9420_chg_in_watchdog_t;

/*! @brief PCA9420 Power Good Comparator Enable definition. */
typedef enum _pca9420_pgood_en
{
    kPCA9420_PGoodDisabled = 0x00U, /* Output voltage power-good comparators are disabled. */
    kPCA9420_PGoodEnabled = 0x01U,  /* Output voltage power-good comparators are enabled. */
} pca9420_pgood_en_t;

/*! @brief PCA9420 VSYS Pre Warning Voltage Threshold definition. */
typedef enum _pca9420_asys_prewarning
{
    kPCA9420_AsysPreWarn3V3 = 0x00U, /* VSYS pre-warning voltage threshold 3.3V */
    kPCA9420_AsysPreWarn3V4 = 0x40U, /* VSYS pre-warning voltage threshold 3.4V */
    kPCA9420_AsysPreWarn3V5 = 0x80U, /* VSYS pre-warning voltage threshold 3.5V */
    kPCA9420_AsysPreWarn3V6 = 0xC0U, /* VSYS pre-warning voltage threshold 3.6V */
} pca9420_asys_prewarning_t;

