embedlinux/Code_learning/SDK_2.5.0_MIMXRT685S/components/pca9420/fsl_pca9420.h
/*! @brief PCA9420 VSYS Input Source Selection definition. */
typedef enum _pca9420_asys_input_sel
{
    kPCA9420_AsysInputSelVbatVin =
        0x00U, /* VSYS is powered by either VBAT or VIN, VIN has higher priority if both are presented. */
    kPCA9420_AsysInputSelVbat = 0x10U, /* VSYS is powered by VBAT only. */
    kPCA9420_AsysInputSelVin = 0x20U,  /* VSYS is powered by VIN only. */
    kPCA9420_AsysInputSelNone = 0x30U, /* VSYS is disconnected to either VBAT or VIN (test purpose only). */
} pca9420_asys_input_sel_t;

/*! @brief PCA9420 VIN Over-voltage Protection Threshold Selection definition. */
typedef enum _pca9420_vin_ovp_sel
{
    kPCA9420_VinOvpSel5V5 = 0x00U, /* VIN Over-Voltage Protection threshold 5.5V. */
    kPCA9420_VinOvpSel6V0 = 0x04U, /* VIN Over-Voltage Protection threshold 6.0V. */
} pca9420_vin_ovp_sel_t;

/*! @brief PCA9420 VIN Under-voltage Lockout Threshold Selection definition. */
typedef enum _pca9420_vin_uvlo_sel
{
    kPCA9420_VinUvloSel2V9 = 0x0U, /* VIN Under-Voltage Lockout threshold 2.9V. */
    kPCA9420_VinUvloSel3V1 = 0x1U, /* VIN Under-Voltage Lockout threshold 3.1V. */
    kPCA9420_VinUvloSel3V3 = 0x2U, /* VIN Under-Voltage Lockout threshold 3.3V. */
    kPCA9420_VinUvloSel3V5 = 0x3U, /* VIN Under-Voltage Lockout threshold 3.5V. */
} pca9420_vin_uvlo_sel_t;

/*! @brief PCA9420 VSYS Under-voltage Lockout Threshold Selection definition. */
typedef enum _pca9420_asys_uvlo_sel
{
    kPCA9420_AsysUvloSel2V4 = 0x00U, /* VSYS Under-Voltage Lockout threshold 2.4V. */
    kPCA9420_AsysUvloSel2V5 = 0x40U, /* VSYS Under-Voltage Lockout threshold 2.5V. */
    kPCA9420_AsysUvloSel2V6 = 0x80U, /* VSYS Under-Voltage Lockout threshold 2.6V. */
    kPCA9420_AsysUvloSel2V7 = 0xC0U, /* VSYS Under-Voltage Lockout threshold 2.7V. */
} pca9420_asys_uvlo_sel_t;

/*! @brief PCA9420 Disable Charge Termination definition. */
typedef enum _pca9420_charge_term_dis
{
    kPCA9420_ChargeTermEnabled = 0x00U,  /* Enable the charge termination control. */
    kPCA9420_ChargeTermDisabled = 0x20U, /* Disable the charge termination control, fast charge timer is reset. */
} pca9420_charge_term_dis_t;

/*! @brief PCA9420 Thermal Shutdown Temperature Threshold definition. */
typedef enum _pca9420_them_shdn
{
    kPCA9420_ThemShdn95C = 0x00U,  /* Thermal shutdown temperature threshold 95C. */
    kPCA9420_ThemShdn100C = 0x04U, /* Thermal shutdown temperature threshold 100C. */
    kPCA9420_ThemShdn105C = 0x08U, /* Thermal shutdown temperature threshold 105C. */
    kPCA9420_ThemShdn110C = 0x0CU, /* Thermal shutdown temperature threshold 110C. */
    kPCA9420_ThemShdn115C = 0x10U, /* Thermal shutdown temperature threshold 115C. */
    kPCA9420_ThemShdn120C = 0x14U, /* Thermal shutdown temperature threshold 120C. */
    kPCA9420_ThemShdn125C = 0x18U, /* Thermal shutdown temperature threshold 125C. */
} pca9420_them_shdn_t;

/*! @brief PCA9420 Die Temperature Warning Threshold definition. */
typedef enum _pca9420_die_temp_warning
{
    kPCA9420_DieTempWarn75C = 0x00U, /* Die temperature warning threshold 75C. */
    kPCA9420_DieTempWarn80C = 0x01U, /* Die temperature warning threshold 80C. */
    kPCA9420_DieTempWarn85C = 0x02U, /* Die temperature warning threshold 85C. */
    kPCA9420_DieTempWarn90C = 0x03U, /* Die temperature warning threshold 90C. */
} pca9420_die_temp_warning_t;

/*! @brief PCA9420 Mode I2C definition. */
typedef enum _pca9420_mode_i2c
{
    kPCA9420_ModeI2cMode0 = 0x00U, /* PMIC mode set to mode 0, in case MODE_CTRL_SEL == 0. */
    kPCA9420_ModeI2cMode1 = 0x08U, /* PMIC mode set to mode 1, in case MODE_CTRL_SEL == 0. */
    kPCA9420_ModeI2cMode2 = 0x10U, /* PMIC mode set to mode 2, in case MODE_CTRL_SEL == 0. */
    kPCA9420_ModeI2cMode3 = 0x18U, /* PMIC mode set to mode 3, in case MODE_CTRL_SEL == 0. */
} pca9420_mode_i2c_t;

/*! @brief PCA9420 ON Pin Long Glitch Timer definition. */
typedef enum _pca9420_on_glt_long
{
    kPCA9420_OnGltLong4s = 0x00U,  /* ON pin long glitch timer set to 4 sec. */
    kPCA9420_OnGltLong8s = 0x01U,  /* ON pin long glitch timer set to 8 sec. */
    kPCA9420_OnGltLong12s = 0x02U, /* ON pin long glitch timer set to 12 sec. */
    kPCA9420_OnGltLong16s = 0x03U, /* ON pin long glitch timer set to 16 sec. */
} pca9420_on_glt_long_t;

/* TODO: charger function */

/*! @brief PCA9420 Regulator Status definition. */
typedef enum _pca9420_reg_status
{
    kPCA9420_RegStatusVoutSw1OK = 0x80U,  /* SW1 VOUT Power good status */
    kPCA9420_RegStatusVoutSw2OK = 0x40U,  /* SW2 VOUT Power good status */
    kPCA9420_RegStatusVoutLdo1OK = 0x20U, /* LDO1 VOUT Power good status */
    kPCA9420_RegStatusVoutLdo2OK = 0x10U, /* LDO2 VOUT Power good status */
} pca9420_reg_status_t;

/*! @brief PCA9420 Regulator Control definition. */
typedef enum _pca9420_reg_ctl
{
    kPCA9420_RegCtlSw1Bleed = 0x08U,  /* SW1 output active discharge control (0: enable, 1: disable). */
    kPCA9420_RegCtlSw2Bleed = 0x04U,  /* SW2 output active discharge control (0: enable, 1: disable). */
    kPCA9420_RegCtlLdo1Bleed = 0x02U, /* LDO1 output active discharge control (0: enable, 1: disable). */
    kPCA9420_RegCtlLdo2Bleed = 0x01U, /* LDO2 output active discharge control (0: enable, 1: disable). */
} pca9420_reg_ctl_t;

/*! @brief PCA9420 Ship Mode Enablement definition. */
typedef enum _pca9420_ship_en
{
    kPCA9420_ShipModeDisabled = 0x00U, /* Ship mode disabled. */
    kPCA9420_ShipModeEnabled = 0x80U,  /* Ship mode enabled, chip enters state with lowest quiescent consumption. */
} pca9420_ship_en_t;

/*! @brief PCA9420 Mode Control Selection definition. */
typedef enum _pca9420_mode_sel
{
    kPCA9420_ModeSelI2C = 0x00U, /* Mode control select by I2C register bits. */
    kPCA9420_ModeSelPin = 0x40U, /* Mode control select by external pins. */
} pca9420_mode_sel_t;

/*! @brief PCA9420 SW1 Output Voltage definition. */
typedef enum _pca9420_sw1_out
{
    kPCA9420_Sw1OutVolt0V500 = 0x00U, /* SW1 output voltage 0.500V. */
    kPCA9420_Sw1OutVolt0V525 = 0x01U, /* SW1 output voltage 0.525V. */
    kPCA9420_Sw1OutVolt0V550 = 0x02U, /* SW1 output voltage 0.550V. */
    kPCA9420_Sw1OutVolt0V575 = 0x03U, /* SW1 output voltage 0.575V. */
    kPCA9420_Sw1OutVolt0V600 = 0x04U, /* SW1 output voltage 0.600V. */
    kPCA9420_Sw1OutVolt0V625 = 0x05U, /* SW1 output voltage 0.625V. */
    kPCA9420_Sw1OutVolt0V650 = 0x06U, /* SW1 output voltage 0.650V. */
    kPCA9420_Sw1OutVolt0V675 = 0x07U, /* SW1 output voltage 0.675V. */
    kPCA9420_Sw1OutVolt0V700 = 0x08U, /* SW1 output voltage 0.700V. */
    kPCA9420_Sw1OutVolt0V725 = 0x09U, /* SW1 output voltage 0.725V. */
    kPCA9420_Sw1OutVolt0V750 = 0x0AU, /* SW1 output voltage 0.750V. */
    kPCA9420_Sw1OutVolt0V775 = 0x0BU, /* SW1 output voltage 0.775V. */
    kPCA9420_Sw1OutVolt0V800 = 0x0CU, /* SW1 output voltage 0.800V. */
    kPCA9420_Sw1OutVolt0V825 = 0x0DU, /* SW1 output voltage 0.825V. */
    kPCA9420_Sw1OutVolt0V850 = 0x0EU, /* SW1 output voltage 0.850V. */
    kPCA9420_Sw1OutVolt0V875 = 0x0FU, /* SW1 output voltage 0.875V. */
    kPCA9420_Sw1OutVolt0V900 = 0x10U, /* SW1 output voltage 0.900V. */
    kPCA9420_Sw1OutVolt0V925 = 0x11U, /* SW1 output voltage 0.925V. */
    kPCA9420_Sw1OutVolt0V950 = 0x12U, /* SW1 output voltage 0.950V. */
    kPCA9420_Sw1OutVolt0V975 = 0x13U, /* SW1 output voltage 0.975V. */
    kPCA9420_Sw1OutVolt1V000 = 0x14U, /* SW1 output voltage 1.000V. */
    kPCA9420_Sw1OutVolt1V025 = 0x15U, /* SW1 output voltage 1.025V. */
    kPCA9420_Sw1OutVolt1V050 = 0x16U, /* SW1 output voltage 1.050V. */
    kPCA9420_Sw1OutVolt1V075 = 0x17U, /* SW1 output voltage 1.075V. */
    kPCA9420_Sw1OutVolt1V100 = 0x18U, /* SW1 output voltage 1.100V. */
    kPCA9420_Sw1OutVolt1V125 = 0x19U, /* SW1 output voltage 1.125V. */
    kPCA9420_Sw1OutVolt1V150 = 0x1AU, /* SW1 output voltage 1.150V. */
    kPCA9420_Sw1OutVolt1V175 = 0x1BU, /* SW1 output voltage 1.175V. */
    kPCA9420_Sw1OutVolt1V200 = 0x1CU, /* SW1 output voltage 1.200V. */
    kPCA9420_Sw1OutVolt1V225 = 0x1DU, /* SW1 output voltage 1.225V. */
    kPCA9420_Sw1OutVolt1V250 = 0x1EU, /* SW1 output voltage 1.250V. */
    kPCA9420_Sw1OutVolt1V275 = 0x1FU, /* SW1 output voltage 1.275V. */
    kPCA9420_Sw1OutVolt1V300 = 0x20U, /* SW1 output voltage 1.300V. */
    kPCA9420_Sw1OutVolt1V325 = 0x21U, /* SW1 output voltage 1.325V. */
    kPCA9420_Sw1OutVolt1V350 = 0x22U, /* SW1 output voltage 1.350V. */
    kPCA9420_Sw1OutVolt1V375 = 0x23U, /* SW1 output voltage 1.375V. */
    kPCA9420_Sw1OutVolt1V400 = 0x24U, /* SW1 output voltage 1.400V. */
    kPCA9420_Sw1OutVolt1V425 = 0x25U, /* SW1 output voltage 1.425V. */
    kPCA9420_Sw1OutVolt1V450 = 0x26U, /* SW1 output voltage 1.450V. */
    kPCA9420_Sw1OutVolt1V475 = 0x27U, /* SW1 output voltage 1.475V. */
    kPCA9420_Sw1OutVolt1V500 = 0x28U, /* SW1 output voltage 1.500V. */
    kPCA9420_Sw1OutVolt1V800 = 0x3FU, /* SW1 output voltage 1.800V. */
} pca9420_sw1_out_t;

