embedlinux/Code_learning/SDK_2.5.0_MIMXRT685S/components/pca9420/fsl_pca9420.h
    kPCA9420_Ldo2OutVolt2V700 = 0x20U, /* LDO2 output voltage 2.700V. */
    kPCA9420_Ldo2OutVolt2V725 = 0x21U, /* LDO2 output voltage 2.725V. */
    kPCA9420_Ldo2OutVolt2V750 = 0x22U, /* LDO2 output voltage 2.750V. */
    kPCA9420_Ldo2OutVolt2V775 = 0x23U, /* LDO2 output voltage 2.775V. */
    kPCA9420_Ldo2OutVolt2V800 = 0x24U, /* LDO2 output voltage 2.800V. */
    kPCA9420_Ldo2OutVolt2V825 = 0x25U, /* LDO2 output voltage 2.825V. */
    kPCA9420_Ldo2OutVolt2V850 = 0x26U, /* LDO2 output voltage 2.850V. */
    kPCA9420_Ldo2OutVolt2V875 = 0x27U, /* LDO2 output voltage 2.875V. */
    kPCA9420_Ldo2OutVolt2V900 = 0x28U, /* LDO2 output voltage 2.900V. */
    kPCA9420_Ldo2OutVolt2V925 = 0x29U, /* LDO2 output voltage 2.925V. */
    kPCA9420_Ldo2OutVolt2V950 = 0x2AU, /* LDO2 output voltage 2.950V. */
    kPCA9420_Ldo2OutVolt2V975 = 0x2BU, /* LDO2 output voltage 2.975V. */
    kPCA9420_Ldo2OutVolt3V000 = 0x2CU, /* LDO2 output voltage 3.000V. */
    kPCA9420_Ldo2OutVolt3V025 = 0x2DU, /* LDO2 output voltage 3.025V. */
    kPCA9420_Ldo2OutVolt3V050 = 0x2EU, /* LDO2 output voltage 3.050V. */
    kPCA9420_Ldo2OutVolt3V075 = 0x2FU, /* LDO2 output voltage 3.075V. */
    kPCA9420_Ldo2OutVolt3V100 = 0x30U, /* LDO2 output voltage 3.100V. */
    kPCA9420_Ldo2OutVolt3V125 = 0x31U, /* LDO2 output voltage 3.125V. */
    kPCA9420_Ldo2OutVolt3V150 = 0x32U, /* LDO2 output voltage 3.150V. */
    kPCA9420_Ldo2OutVolt3V175 = 0x33U, /* LDO2 output voltage 3.175V. */
    kPCA9420_Ldo2OutVolt3V200 = 0x34U, /* LDO2 output voltage 3.200V. */
    kPCA9420_Ldo2OutVolt3V225 = 0x35U, /* LDO2 output voltage 3.225V. */
    kPCA9420_Ldo2OutVolt3V250 = 0x36U, /* LDO2 output voltage 3.250V. */
    kPCA9420_Ldo2OutVolt3V275 = 0x37U, /* LDO2 output voltage 3.275V. */
    kPCA9420_Ldo2OutVolt3V300 = 0x38U, /* LDO2 output voltage 3.300V. */
} pca9420_ldo2_out_t;

/*! @brief PCA9420 Mode Configuration definition. */
typedef struct _pca9420_modecfg
{
    pca9420_ship_en_t shipModeEnable;
    pca9420_mode_sel_t modeSel;
    pca9420_on_cfg_t onCfg;
    pca9420_wd_timer_t wdogTimerCfg;
    pca9420_sw1_out_t sw1OutVolt;
    pca9420_sw2_out_t sw2OutVolt;
    pca9420_ldo1_out_t ldo1OutVolt;
    pca9420_ldo2_out_t ldo2OutVolt;
    bool enableSw1Out;
    bool enableSw2Out;
    bool enableLdo1Out;
    bool enableLdo2Out;
} pca9420_modecfg_t;

/*! @brief PCA9420 regulators voltage definition. */
typedef struct _pca9420_regulator_mv
{
    uint32_t mVoltSw1;  /* SW1 milli volt. */
    uint32_t mVoltSw2;  /* SW2 milli volt. */
    uint32_t mVoltLdo1; /* LDO1 milli volt. */
    uint32_t mVoltLdo2; /* LDO2 milli volt. */
} pca9420_regulator_mv_t;

/*! @brief PCA9420 Handle definition. */
typedef struct _pca9420_handle
{
    /* Pointer to the user-defined I2C Send Data function. */
    status_t (*I2C_SendFunc)(
        uint8_t deviceAddress, uint32_t subAddress, uint8_t subAddressSize, const uint8_t *txBuff, uint8_t txBuffSize);
    /* Pointer to the user-defined I2C Receive Data function. */
    status_t (*I2C_ReceiveFunc)(
        uint8_t deviceAddress, uint32_t subAddress, uint8_t subAddressSize, uint8_t *rxBuff, uint8_t rxBuffSize);
    /* The I2C Slave Address Read From OTP. */
    uint8_t slaveAddress;
} pca9420_handle_t;

/*! @brief PCA9420 Configuration Structure definition. */
typedef struct _pca9420_config
{
    /* Pointer to the user-defined I2C Send Data function. */
    status_t (*I2C_SendFunc)(
        uint8_t deviceAddress, uint32_t subAddress, uint8_t subAddressSize, const uint8_t *txBuff, uint8_t txBuffSize);
    /* Pointer to the user-defined I2C Receive Data function. */
    status_t (*I2C_ReceiveFunc)(
        uint8_t deviceAddress, uint32_t subAddress, uint8_t subAddressSize, uint8_t *rxBuff, uint8_t rxBuffSize);
    /* Upon VIN plugs in, power up by ON key or not. */
    pca9420_ship_wkup_cfg_t powerUpCfg;
    /* Power down sequence enable */
    pca9420_pwr_dn_en_t startPowerDown;
    /* When the watch dog timer expires, disable charger or not */
    pca9420_chg_in_watchdog_t wdogChargeCtrl;
    /* Power Good Comparators Enable */
    pca9420_pgood_en_t powerGoodEnable;
    /* VIN input current limit. */
    pca9420_vin_ilim_t vinCurrentLimit;
    /* VIN over voltage protection threshold */
    pca9420_vin_ovp_sel_t vinOvpThreshold;
    /* VIN under voltage lockout threshold */
    pca9420_vin_uvlo_sel_t vinUvloThreshold;
    /* VSYS pre-warning threshold */
    pca9420_asys_prewarning_t asysPreWarnThreshold;
    /* VSYS input selection */
    pca9420_asys_input_sel_t asysInputSource;
    /* VSYS under voltage lockout threshold */
    pca9420_asys_uvlo_sel_t asysUvloThreshold;
    /* Charge termination control */
    pca9420_charge_term_dis_t chargeTermDisable;
    /* Thermal shutdown threshold */
    pca9420_them_shdn_t thermalShutdownThreshold;
    /* Die temperature warning threshold */
    pca9420_die_temp_warning_t tempWarnThreshold;
    /* ON pin long glitch timer */
    pca9420_on_glt_long_t onPinTimer;
    /* Disable SW1 active discharge */
    bool disableSw1Bleed;
    /* Disable SW2 active discharge */
    bool disableSw2Bleed;
    /* Disable LDO1 active discharge */
    bool disableLdo1Bleed;
    /* Disable LDO2 active discharge */
    bool disableLdo2Bleed;
    /* The PCA9420 I2C Slave Address. */
    uint8_t slaveAddress;
} pca9420_config_t;

/*!
 * @addtogroup pca9420
 * @{
 */

/*******************************************************************************
 * API
 ******************************************************************************/
#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @name Initialization and Control function
 * @{
 */

/*!
 * @brief Gets the default configuration structure.
 *
 * This function initializes the PCA9420 configuration structure to default values. The default
 * values are as follows.
 *   pca9420Config->I2C_SendFunc              = NULL;
 *   pca9420Config->I2C_ReceiveFunc           = NULL;
 *   pca9420Config->powerUpCfg                = kPCA9420_ShipWkup_PowerUp;
 *   pca9420Config->startPowerDown            = kPCA9420_PwrDnDisabled;
 *   pca9420Config->wdogChargeCtrl            = kPCA9420_ChgInWatchdogChargerContinue;
 *   pca9420Config->powerGoodEnable           = kPCA9420_PGoodEnabled;
 *   pca9420Config->vinCurrentLimit           = kPCA9420_VinIlim_74_85_98;
 *   pca9420Config->vinOvpThreshold           = kPCA9420_VinOvpSel5V5;
 *   pca9420Config->vinUvloThreshold          = kPCA9420_VinUvloSel3V1;
 *   pca9420Config->asysPreWarnThreshold      = kPCA9420_AsysPreWarning3V5;
 *   pca9420Config->asysInputSource           = kPCA9420_AsysInputSelVbatVin;
 *   pca9420Config->asysUvloThreshold         = kPCA9420_AsysUvloSel2V7;
 *   pca9420Config->chargeTermDisable         = kPCA9420_ChargeTermEnabled;
 *   pca9420Config->thermalShutdownThreshold  = kPCA9420_ThemShdn110C;
 *   pca9420Config->tempWarnThreshold         = kPCA9420_DieTempWarn85C;
 *   pca9420Config->onPinTimer                = kPCA9420_OnGltLong8s;
 *   pca9420Config->disableSw1Bleed           = false;
 *   pca9420Config->disableSw2Bleed           = false;
 *   pca9420Config->disableLdo1Bleed          = false;
 *   pca9420Config->disableLdo2Bleed          = false;
 *   pca9420Config->slaveAddress              = PCA9420_DEFAULT_I2C_ADDR;
 *
 * @param config Pointer to the PCA9420 configuration structure.
 */
void PCA9420_GetDefaultConfig(pca9420_config_t *config);

/*!
 * @brief Initializes a PCA9420 instance.
 *
 * This function initializes the PCA9420 regulator with user-defined settings.
 * This example shows how to set up the pca9420_config_t parameters and how
 * to call the PCA9420_Init function by passing in these parameters.
 * @code
 *   pca9420_config_t pca9420Config;
 *   PCA9420_GetDefaultConfig(&pca9420Config);
 *   pca9420Config.I2C_SendFunc    = APP_I2C_SendFunc;
 *   pca9420Config.I2C_ReceiveFunc = APP_I2C_ReceiveFunc;
 *   PCA9420_Init(&pca9420Handle, &pca9420Config);
 * @endcode
 *
 * @param handle PCA9420 Handle.
 * @param config Pointer to the user-defined configuration structure.
 */
void PCA9420_Init(pca9420_handle_t *handle, const pca9420_config_t *config);

/*!
 * @brief Gets the default mode config structure.
 *
 * This function initializes the PCA9420 mode config structure to default values. The default
 * values are as follows.
 *   pca9420ModeCfg->shipModeEnable     = kPCA9420_ShipModeDisabled;
 *   pca9420ModeCfg->modeSel            = kPCA9420_ModeSelPin;
 *   pca9420ModeCfg->onCfg              = kPCA9420_OnCfgDisableModeSwitch;
 *   pca9420ModeCfg->wdogTimerCfg       = kPCA9420_WdTimerDisabled;
 *   pca9420ModeCfg->sw1OutVolt         = kPCA9420_Sw1OutVolt1V000;
 *   pca9420ModeCfg->sw2OutVolt         = kPCA9420_Sw2OutVolt1V800;
 *   pca9420ModeCfg->ldo1OutVolt        = kPCA9420_Ldo1OutVolt1V800;
 *   pca9420ModeCfg->ldo2OutVolt        = kPCA9420_Ldo2OutVolt3V300;
 *   pca9420ModeCfg->enableSw1Out       = true;
 *   pca9420ModeCfg->enableSw2Out       = true;
 *   pca9420ModeCfg->enableLdo1Out      = true;
 *   pca9420ModeCfg->enableLdo2Out      = true;
 *
 * @param config Pointer to the PCA9420 mode configuration structure.
 */
void PCA9420_GetDefaultModeConfig(pca9420_modecfg_t *config);

/*!
 * @brief Gets voltage value in mV from mode configuration.
 *
 * @param config Pointer to the PCA9420 mode configuration structure.
 * @param volt Pointer to the PCA9420 regulator voltage structure.
 */
void PCA9420_GetRegulatorVolt(pca9420_modecfg_t *config, pca9420_regulator_mv_t *volt);

/*!
 * @brief Configure PCA9420 modes for specific modes.
 *
 * This function configures the PCA9420 modes for specific modes with
 * user-defined settings.
 * This example shows how to set up the pca9420_modecfg_t parameters and how
 * to call the PCA9420_WriteModeConfigs function by passing in these parameters.
 * @code
 *   pca9420_modecfg_t pca9420ModeCfg[4];
 *   uint32_t i;
 *   for (i = 0; i < ARRAY_SIZE(pca9420ModeCfg); i++)
 *   {
 *       PCA9420_GetDefaultModeConfig(&pca9420ModeCfg[i]);
 *   }
 *   ...
 *   PCA9420_WriteModeConfigs(&pca9420Handle, kPCA9420_Mode0, &pca9420ModeCfg[0],
 * ARRAY_SIZE(pca9420ModeCfg));
 *   ...
 *   PCA9420_WriteModeConfigs(&pca9420Handle, kPCA9420_Mode2, &pca9420ModeCfg[2], 1);
 * @endcode
 *
 * @param handle PCA9420 Handle.
 * @param modeBase Target mode to start with.
 * @param configs Pointer to the user-defined configuration array.
 * @param num Number of modes to configure.
 */
void PCA9420_WriteModeConfigs(pca9420_handle_t *handle,
                              pca9420_mode_t modeBase,
                              const pca9420_modecfg_t *configs,
                              uint32_t num);

/*!
 * @brief Read PCA9420 mode configurations for specific modes.
 *
 * This function read the PCA9420 mode configurations for specific modes with
 * user-defined settings.
 *
 * @param handle PCA9420 Handle.
 * @param modeBase Target mode to start with.
 * @param configs Pointer to the configuration to save read information.
 * @param num Number of modes to read.
 */
void PCA9420_ReadModeConfigs(pca9420_handle_t *handle,
                             pca9420_mode_t modeBase,
                             pca9420_modecfg_t *configs,
                             uint32_t num);

/*!
 * @brief Switch PCA9420 mode.
 *
 * This function switch the PCA9420 regulators mode with I2C interface.
 *
 * @param handle PCA9420 Handle.
 * @param mode Target mode to go into.
 * @return true on success, false on failure.
 */
bool PCA9420_SwitchMode(pca9420_handle_t *handle, pca9420_mode_t mode);

/*!
 * @brief Get PCA9420 current mode.
 *
 * This function returns the PCA9420 current mode with I2C interface.
 *
 * @param handle PCA9420 Handle.
 * @param mode Current mode.
 * @return true on success, false on failure.
 */
bool PCA9420_GetCurrentMode(pca9420_handle_t *handle, pca9420_mode_t *mode);

/*!
 * @brief Get PCA9420 SW1, SW2, LDO1, LDO2 OK status.
 *
 * This function return the PCA9420 regulators status.
 *
 * @param handle PCA9420 Handle.
 * @return ORed regulator status. see @ref pca9420_reg_status_t for regulator status definition.
 */
uint8_t PCA9420_GetRegulatorStatus(pca9420_handle_t *handle);

/*!
 * @brief Feed PCA9420 watchdog.
 *
 * This function feed the PCA9420 watch dog.
 *
 * @param handle PCA9420 Handle.
 */
void PCA9420_FeedWatchDog(pca9420_handle_t *handle);

/* @} */

/*!
 * @name Basic register access functions
 * @{
 */

/*!
 * @brief Write the value to register array of PCA9420.
 *
 * @param handle Pointer to a valid PCA9420 instance structure.
 * @param regBase variable store base address of register array.
 * @param val variable array to be written to PCA9420.
 * @param size array length in bytes to write.
 * @return true if success or false if error.
 */
bool PCA9420_WriteRegs(pca9420_handle_t *handle, uint8_t regBase, uint8_t *val, uint32_t size);

/*!
 * @brief Read the value of register array in PCA9420.
 *
 * @param handle Pointer to a valid PCA9420 instance structure.
 * @param regBase variable store address of register array.
 * @param val variable array to store return value.
 * @param size array length in bytes to read.
 * @return true if success or false if error.
 */
bool PCA9420_ReadRegs(pca9420_handle_t *handle, uint8_t reg, uint8_t *val, uint32_t size);

/*!
 * @brief Modify some bits in the register in PCA9420.
 * @param handle Pointer to a valid PCA9420 instance structure.
 * @param reg variable store address of register.
 * @param mask The mask code for the bits want to write. The bit you want to write should be 1.
 * @param val Value needs to write into the register.
 * @return true if success or false if error.
 */
bool PCA9420_ModifyReg(pca9420_handle_t *handle, uint8_t reg, uint8_t mask, uint8_t val);

/* @} */

/*!
 * @name Interrupts
 * @{
 */

/*!
 * @brief Enables PCA9420 interrupts according to the provided interrupt source mask.
 *
 * This function enables the PCA9420 interrupts according to the provided interrupt source.
 * The interrupt source mask is a logical OR of enumeration members:
 * see @ref _pca9420_interrupt_source for interrupt sources definition;
 *
 * @param handle Pointer to a valid PCA9420 instance structure.
 * @param source Logic ORed interrupt sources of selected interrupt category to enable.
 */
void PCA9420_EnableInterrupts(pca9420_handle_t *handle, uint32_t source);

/*!
 * @brief Disable PCA9420 interrupts according to the provided interrupt source mask.
 *
 * This function disables the PCA9420 interrupts according to the provided interrupt source.
 * The interrupt source mask is a logical OR of enumeration members:
 * see @ref _pca9420_interrupt_source for interrupt sources definition;
 *
 * @param handle Pointer to a valid PCA9420 instance structure.
 * @param source Logic ORed interrupt sources of selected interrupt category to disable.
 */
void PCA9420_DisableInterrupts(pca9420_handle_t *handle, uint32_t source);

/*!
 * @brief Get interrupt flags.
 *
 * This function gets all interrupt flags.
 * The flags are returned as the logical OR value of the corresponding interrupt source:
 * see @ref _pca9420_interrupt_source for interrupt sources definition;
 *
 * @param handle Pointer to a valid PCA9420 instance structure.
 * @return status flags which are ORed by the enumerators in the corresponding interrupt source.
 */
uint32_t PCA9420_GetInterruptStatus(pca9420_handle_t *handle);

/*!
 * @brief Clear interrupt flags.
 *
 * This function clears interrupt flags of selected source.
 * The interrupt source mask is a logical OR of enumeration members:
 * see @ref _pca9420_interrupt_source for interrupt sources definition;
 *
 * @param handle Pointer to a valid PCA9420 instance structure.
 * @param source Logic ORed interrupt sources of selected interrupt source to clear.
 */
void PCA9420_ClearInterruptStatus(pca9420_handle_t *handle, uint32_t source);
/* @} */

/*!
 * @name mode control functions
 * @{
 */

/* @} */

#if defined(__cplusplus)
}
#endif

/*! @} */

#endif /* _FSL_PCA9420_H_ */

/*******************************************************************************
 * EOF
 ******************************************************************************/
